//Автор - Калюжний Денис, К-13, Варіант 156

//функція printMas5 обчислює та повертає суму
//мінімального та максимального елементів масива 
double printMas5(int mas[], int N);

//функція coutArray виводить елементи масива 
//через кому або повідомляє про їх відсутність
void coutArray(int mas[], int N);

//функція readArray1 генерує N-ну кількіть, яка задається користувачем,
//випадкових цілих чисел та записує їх елементами масива
bool readArray1(int mas[], int &N);

//функція readArray2 зчитує введені користувачем послідності 
//цілих значень та записує їх елементами масива.
//зчитування припиняється коли трапляється помилка введення 
//(користувач ввів неціле число)
void readArray2(int mas[], int &N);
